import { ILanguageFile } from '../interfaces/ILanguage.interface';

export const greek: ILanguageFile = {
    components: {
        navbar: {
            skip: `Παράλειψη`,
        },
        identification: {
            name: 'ID',
            continue: 'Συνέχεια'
        },
        procedureContainer: {
            continue: `Συνέχεια`,
        },
        home: {
            firstPage: {
                title: `Καλώς ήρθατε στο eChecker`,
                firstParagraph: `Το eChecker ελέγχει την ακοή σας, την όραση και τη μνήμη. 
                Το eChecker χρησιμοποιεί σύντομα ερωτηματολόγια και διαδραστικά τεστ. 
                Κάθε μέρος διαρκεί μόνο λίγα λεπτά.`,
                secondParagraph: `Παρακαλούμε βεβαιωθείτε ότι βρίσκεστε σε ένα ήσυχο δωμάτιο και δεν υπάρχει 
                κάτι στο χώρο που μπορεί να αποσπάσει την προσοχή σας ενώ κάνετε το eChecker.`,
                firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε!`,
            }
        },
        chapterSelection: {
            title: `Ποιο τεστ θα θέλατε να κάνετε;`,
            Cognition: `Τεστ ακοής`,
            Hearing: `Τεστ μνήμης`,
            Vision: `Τεστ όρασης`,
        },
        cognition: {
            chapterDescription: {
                firstPage: {
                    title: `Τεστ μνήμης`,
                    firstParagraph: `Το τεστ μνήμης περιλαμβάνει ένα ερωτηματολόγιο που ρωτάει σχετικά 
                    με τη μνήμη και τις δεξιότητες σκέψης σας και ένα παιχνίδι λέξεων που σας ζητά να θυμηθείτε μερικές λέξεις.`,
                    secondParagraph: ``,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε με το ερωτηματολόγιο.`,
                }
            },
            test: {
                miniInstructions: 'Έχει παρουσιαστεί αυτή η λέξη μετά την έναρξη του τεστ;',
                no: 'Όχι',
                yes: 'Ναι',
                firstIntro: 'Τώρα θα σας θέσουμε μερικές ερωτήσεις.<br>Απαντήστε όσο το δυνατόν πιο γρήγορα και με ακρίβεια.<br><br>Πατήστε "Συνέχεια" για να συνεχίσετε.',
                secondIntro: 'Τώρα θα σας δείξουμε μερικές λέξεις.<br>Παρακαλείσθε να αποφασίσετε αν τις έχετε ήδη δει ή όχι.<br><br>Πατήστε "Συνέχεια" για να συνεχίσετε.',
                continue: 'Συνέχεια',
                outro: 'Τέλεια!<br>Έχετε ολοκληρώσει το παιχνίδι λέξεων, πατήστε "Συνέχεια" για να συνεχίσετε.'
            },
            testDescription: {
                firstPage: {
                    title: `Οδηγίες παιχνιδιού λέξεων`,
                    firstParagraph: `Το παιχνίδι λέξεων είναι επόμενο.`,
                    secondParagraph: `Κάποια ομιλία ακούγεται τώρα. 
                    Ρυθμίστε την ένταση ήχου (εάν είναι απαραίτητο) στη συσκευή σας,  ώστε να ακούγεται καθαρά η ομιλία.`,
                    firstHint: `Μπορείτε να χρησιμοποιήσετε εξωτερικά ηχεία ή ακουστικά εάν είναι απαραίτητο.`,
                    secondHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε τον ήχο δοκιμής.`,
                    thirdHint: `Πατήστε "Συνέχεια" όταν η ομιλία ακούγεται καθαρά.`,
                    soundFile: 'TestMemorySound.en.mp3'
                },
                secondPage: {
                    title: `Οδηγίες παιχνιδιού λέξεων`,
                    firstParagraph: `Θα σας παρουσιαστούν μερικές λέξεις. Προσπαθήστε να τις θυμηθείτε. Θα σας ζητήσουμε να τις ανακαλέσετε αργότερα.`,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσει το παιχνίδι λέξεων.`,
                }
            },
            testResult: {},
            questionnaire: {},
            questionnaireDescription: {
                firstPage: {
                    title: `Οδηγίες ερωτηματολογίου μνήμης`,
                    firstParagraph: `Αυτό το ερωτηματολόγιο πρέπει να συμπληρωθεί από κάποιον που σας γνωρίζει τουλάχιστον 10 χρόνια. 
                    Θα μπορούσε να συμπληρωθεί από έναν συγγενή ή έναν φίλο.<br> 
                    Εάν κανείς δεν μπορεί να συμπληρώσει το ερωτηματολόγιο, παρακαλώ κάντε κλικ στο κουμπί "Παράλειψη" παραπάνω.<br> 
                    Εάν κάποιος συγγενής ή φίλος μπορεί να συμπληρώσει το ερωτηματολόγιο για εσάς, 
                    παρακαλώ κάντε κλικ στο κουμπί "Συνέχεια" για να ξεκινήσετε το ερωτηματολόγιο.
                    `
                },
                secondPage: {
                    title: `Οδηγίες ερωτηματολογίου μνήμης`,
                    firstParagraph: `Τώρα θέλουμε να θυμηθείτε πως ήταν ο φίλος ή ο συγγενής σας πριν 
                    από 10 χρόνια και να το συγκρίνετε με το πως είναι τώρα.<br> 
                    Οι ακόλουθες ερωτήσεις αφορούν περιπτώσεις στις οποίες το άτομο 
                    πρέπει να χρησιμοποιήσει τη μνήμη του ή την ευφυΐα του. 
                    Θέλουμε να αναφέρετε εάν αυτό έχει βελτιωθεί, 
                    εάν παρέμεινε το ίδιο ή εάν χειροτέρεψε τα τελευταία 10 χρόνια.<br> 
                    Δώστε έμφαση στο πόσο σημαντική είναι η σύγκριση της σημερινής επίδοσης με πριν 
                    δέκα χρόνια. Έτσι, αν πριν από 10 χρόνια αυτό το άτομο πάντα ξέχναγε πού 
                    είχε αφήσει πράγματα του/της, και εξακολουθεί να το κάνει, 
                    τότε αυτό θεωρείται "Όχι, ιδιαίτερη αλλαγή".<br> 
                    Παρακαλώ υποδείξτε τις αλλαγές που έχετε παρατηρήσει 
                    επισημαίνοντας την κατάλληλη απάντηση.`
                }
            },
            questionnaireResult: {}
        },
        hearing: {
            chapterDescription: {
                firstPage: {
                    title: `Τεστ ακοής`,
                    firstParagraph: `Το τεστ ακοής περιλαμβάνει ένα ερωτηματολόγιο και ένα τεστ ομιλίας.`,
                    secondParagraph: `Το ερωτηματολόγιο θα απαντήσετε ερωτήσεις σχετικά με την ακοή σας.`,
                    thirdParagraph: `Το τεστ ομιλίας περιλαμβάνει την αναγνώριση αριθμών που παρουσιάζονται ταυτόχρονα με θόρυβο.`,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε το ερωτηματολόγιο.`,
                }
            },
            test: {
                startHint: 'Πατήστε "Συνέχεια" για να ξεκινήσει το τεστ ακοής.',
                continueHint: 'Εισαγάγετε τα αναγνωρισμένα ψηφία με το αριθμητικό πληκτρολόγιο παρακάτω.<br>Χρησιμοποιήστε το &larr; κουμπί για να διαγράψετε έναν αριθμό.<br>Εάν δεν είστε βέβαιοι για έναν αριθμό, παρακαλούμε μαντέψετε.',
                continue: 'Συνέχεια'
            },
            testDescription: {
                firstPage: {
                    title: `Οδηγίες τεστ ομιλίας`,
                    firstParagraph: `Ακολουθεί το τεστ ομιλίας.`,
                    secondParagraph: `Κάποια ομιλία ακούγεται τώρα. 
                    Ρυθμίστε την ένταση ήχου (εάν είναι απαραίτητο) στη συσκευή σας, για να ακούγεται καθαρά η ομιλία.`,
                    firstHint: `Μπορείτε να χρησιμοποιήσετε εξωτερικά ηχεία ή ακουστικά εάν είναι απαραίτητο.`,
                    secondHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε τον ήχο δοκιμής.`,
                    thirdHint: `Πατήστε "Συνέχεια" όταν η ομιλία ακούγεται καθαρά.`,
                    soundFile: 'TestTripleSound.en.mp3'
                },
                secondPage: {
                    title: `Οδηγίες τεστ ομιλίας`,
                    firstParagraph: `Θα ακούσετε τρεις αριθμούς, που θα παρουσιαστούν ταυτόχρονα με θόρυβο  
                    (για παράδειγμα, "Τα ψηφία ένα, πέντε, τρία"). 
                    Πληκτρολογήστε τους τρεις αριθμούς που ακούτε χρησιμοποιώντας το αριθμητικό πληκτρολόγιο στην οθόνη  
                    (για παράδειγμα, 1,5,3). 
                    Μπορείτε να χρησιμοποιήσετε το &larr; κουμπί για να διαγράψετε έναν αριθμό εάν κάνετε κάποιο λάθος.`,
                    secondParagraph: `Ορισμένοι αριθμοί μπορεί να είναι δύσκολο να ακουστούν. 
                    Παρακαλούμε εισάγετε πάντα τρεις αριθμούς. Αν δεν είστε σίγουροι, παρακαλούμε να μαντέψετε.`,
                    thirdParagraph: ``,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσει το τεστ ακοής.`,
                }
            },
            testResult: {},
            questionnaire: {},
            questionnaireDescription: {
                firstPage: {
                    title: `Οδηγίες ερωτηματολογίου ακοής`,
                    firstParagraph: `Υπάρχουν 12 ερωτήσεις σχετικά με την ακοή σας.<br> 
                    Επιλέξτε την απάντηση που σας περιγράφει καλύτερα.<br> 
                    Παρακαλούμε πάντα να επιλέγετε μία από τις απαντήσεις και μετά κάντε κλικ στο "Συνέχεια".`,
                }
            },
            questionnaireResult: {}
        },
        vision: {
            chapterDescription: {
                firstPage: {
                    title: `Τεστ όρασης`,
                    firstParagraph: `Το τεστ όρασης περιλαμβάνει ένα ερωτηματολόγιο και ένα τεστ οξύτητας.`,
                    secondParagraph: `Το ερωτηματολόγιο θέτει ερωτήσεις σχετικά με την όραση σας.`,
                    thirdParagraph: `Στο τεστ οξύτητας, θα δείτε τετράγωνα σε διαφορετικά μεγέθη. 
                    Κάθε τετράγωνο έχει ένα κενό σε μία πλευρά. 
                    Το τεστ περιλαμβάνει το να υποδείξετε σε ποια πλευρά του τετραγώνου βρίσκεται το κενό.`,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσετε με το ερωτηματολόγιο.`,
                }
            },
            test: {
                miniInstructions: '<h1>Πατήστε το βέλος στο πλάι του κενού, ή μαντέψτε εάν δεν είστε βέβαιοι.</h1>',
            },
            testDescription: {
                firstPage: {
                    title: `Τεστ όρασης`,
                    firstParagraph: `Πριν ξεκινήσουμε το τεστ όρασης, πρέπει να βεβαιωθείτε ότι η οθόνη έχει ρυθμιστεί σωστά. 
                    Θα χρειαστείτε μια πιστωτική κάρτα (ή μια κάρτα που έχει το ίδιο μέγεθος με μια πιστωτική κάρτα).`,
                    secondParagraph: `Μην αλλάξετε το zoom (την μεγέθυνση) της οθόνης από 100% σε διαφορετική τιμή.`,
                    firstHint: `Πατήστε συνέχεια όταν είστε έτοιμοι να ελέγξετε τη ρύθμιση της οθόνης.`,
                    secondHint: ``
                },
                secondPage: {
                    title: `Τεστ όρασης`,
                    firstParagraph: `Τώρα τοποθετήστε την πιστωτική σας κάρτα στην οθόνη. 
                    Ρυθμίστε το πλάτος του ορθογωνίου πιο κάτω έτσι ώστε να έχει το ίδιο μέγεθος 
                    με την πιστωτική κάρτα χρησιμοποιώντας τα κουμπιά μικρού και μεγάλου - και +.`,
                    secondParagraph: ``,
                    bankCardHint: `Compare size with <\br> your bank card`,
                    firstHint: `Πατήστε συνέχεια όταν το ορθογώνιο έχει το ίδιο πλάτος με την κάρτα.`
                },
                thirdPage: {
                    title: `Οδηγίες τεστ όρασης`,
                    firstParagraph: `Χρησιμοποιήστε απόσταση τουλάχιστον minDistance εκατοστών (εκ).   
                    Μια απόσταση optDistance εκ θα ήταν η καλύτερη.`,
                    secondParagraph: `Παρακαλούμε εισάγετε την απόσταση που θα χρησιμοποιήσετε σε εκ:`,
                    firstHint: `Παρακαλούμε χρησιμοποιήστε μεγαλύτερη απόσταση, τουλάχιστον minDistance εκ. 
                    optDistance εκ θα ήταν καλύτερα. Παρακαλούμε ρυθμίστε την απόσταση.`,
                    secondHint: `Μπορείτε να κάνετε το τεστ, αλλά η απόσταση optDistance εκ θα ήταν καλύτερη.
                    Πατήστε "Συνέχεια" για να ξεκινήσετε ή να ρυθμίσετε την απόσταση.`,
                    thirdHint: `Αυτή η απόσταση είναι εξαιρετική. Πατήστε "Συνέχεια" για να ξεκινήσετε.`,
                },
                fourthPage: {
                    title: `Οδηγίες τεστ όρασης`,
                    firstParagraph: `Θα δείτε τετράγωνα σε διαφορετικά μεγέθη. Κάθε τετράγωνο έχει ένα κενό στη μία πλευρά.`,
                    secondParagraph: `Πατήστε το κουμπί με το βέλος ανάλογα με την πλευρά που βρίσκεται το κενό.`,
                    thirdParagraph: `Για παράδειγμα: Εάν είδες αυτό το σχήμα Π θα πατήσεις το darr; βέλος κάτω από το σύμβολο.`,
                    fourthParagraph: `Μερικά τετράγωνα μπορεί να είναι δύσκολο να τα δείτε. 
                    Εάν δεν είστε σίγουροι σε ποια πλευρά βρίσκεται το κενό, παρακαλούμε να υποθέσετε.`,
                    fifthParagraph: ``,
                    firstHint: `Πατήστε "Συνέχεια" για να ξεκινήσει η εξέταση όρασης.`,
                }
            },
            testResult: {
                firstCase: 'Δεν υπάρχει αποτέλεσμα, το όριο είναι μεγαλύτερο από 6/X',
                secondCase: 'Το όριο είναι 6/X ή λιγότερο',
                thirdCase: 'Το όριο είναι 6/X'
            },
            questionnaire: {},
            questionnaireDescription: {
                firstPage: {
                    title: `Οδηγίες ερωτηματολογίου οράσεως`,
                    firstParagraph: `Υπάρχουν 20 ερωτήσεις σχετικά με την όραση σας.<br> 
                    Επιλέξτε την απάντηση που σας περιγράφει καλύτερα.<br> 
                    Παρακαλούμε πάντα να επιλέγετε μία από τις απαντήσεις και μετά να κάνετε κλικ στο "Συνέχεια".`,
                }
            },
            questionnaireResult: {
                noResult: 'Δεν υπάρχει αποτέλεσμα'
            }
        }
    }
};
