import { QuestionType } from '../../../enums/QuestionType.enum';
import { IQuestionnaire } from '../../../interfaces/IQuestionnaire.interface';

export let IQCODE_gr: IQuestionnaire = {
  id: 'IQCODE',
  title: 'Memory questionnaire',
  questions: [
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται πράγματα που αφορούν την οικογένεια και φίλους πχ. Επαγγέλματα, γενέθλια, διευθύνσεις.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται πράγματα που έχουν συμβεί πρόσφατα.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται συζητήσεις που έχουν γίνει αφού έχουν περάσει κάποιες μέρες.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται τον αριθμό του τηλεφώνου και την διεύθυνση του/της.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται τι μέρα και τι μήνας είναι.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται που φυλάσσονται συνήθως τα πράγματα.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Θυμάται που να βρει πράγματα τα οποία έχουν τοποθετηθεί σε ένα διαφορετικό μέρος απ’ ότι συνήθως.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Ξέρει πως να χρησιμοποιεί τις γνώριμες μηχανές που βρίσκονται στο σπίτι.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να μάθει πώς να χρησιμοποιεί μια καινούρια συσκευή/μηχάνημα στο σπίτι.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μαθαίνει καινούρια πράγματα γενικά.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να ακολουθήσει μια ιστορία από ένα βιβλίο ή την τηλεόραση.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να πάρει αποφάσεις για καθημερινά θέματα.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να χειριστεί χρήματα για να κάνει ψώνια.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να χειριστει οικονομικά θέματα, πχ. Την σύνταξη, να ασχοληθεί με την τράπεζα.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Μπορεί να χειριστεί άλλα αριθμητικά προβλήματα της καθημερινότητας, πχ. Γνωρίζει πόσο φαγητό πρέπει να αγοράσει, θυμάται πόσο καιρό έχει να επισκεφθεί φίλους ή οικογένεια.',
      type: QuestionType.single,
      answerTemplateNr: 0
    },
    {
      question: 'Συγκρίνοντας με πριν 10 χρόνια, πως είναι αυτό το άτομο σχετικά με το να: Χρησιμοποιεί το μυαλό του/της για να αντιληφθεί τι συμβαίνει και για να σκεφτεί τα πράγματα με λογικό τρόπο.',
      type: QuestionType.single,
      answerTemplateNr: 0
    }
  ],
  answerTemplates: [
    [
      {
        answer: 'Πολλή βελτίωση',
        value: 1
      },
      {
        answer: 'Λίγη βελτίωση',
        value: 2
      },
      {
        answer: 'Όχι ιδιαίτερη αλλαγή',
        value: 3
      },
      {
        answer: 'Λίγο χειρότερα',
        value: 4
      },
      {
        answer: 'Πολύ χειρότερα',
        value: 5
      }
    ]
  ]
}
